{"shoes":[{"shoeID":"0","shoeName":"","shoePlayer":"","shoeBrand":"","shoeDate":"","shoeDesc":""},{"shoeID":"1","shoeName":"Air Swoopes I","shoePlayer":"Sheryl Swoopes","shoeBrand":"Nike","shoeDate":"1995","shoeDesc":"Right between her 1993 NCAA championship and the lead up to the 1996 Atlanta Olympic games along with the women’s <a href=​​https://espnpressroom.com/us/press-releases/2022/06/espn-films-latest-30-for-30-dream-on-chronicling-the-journey-of-the-1996-womens-olympic-basketball-team-premieres-june-15-at-8-p-m-et/> “Dream Team”</a>, Sheryl Swoopes dropped the Nike Air Swoopes I, making her the first women’s basketball player to have a signature sneaker. Swoopes was hands-on in the design process, quite literally: the sneakers have a back ankle strap to help you get them on without <a href=https://www.espn.com/espnw/culture/story/_/id/27901597/sneakercenter-sheryl-swoopes-being-first-woman-signature-athletic-shoe>breaking a nail</a>. There’s also an “S” shape on the bottom, <a href=https://www.wbur.org/onlyagame/2018/10/19/air-swoopes-nike-wnba-sneakers> a choice explained</a> by Nike Senior Design Director Marni Gerber as “she's up in the air, that was to put Sheryl Swoopes — SS — in your face.”"},{"shoeID":"2","shoeName":"Air Swoopes II","shoePlayer":"Sheryl Swoopes","shoeBrand":"Nike","shoeDate":"1996","shoeDesc":"The Air Swoopes II came out the following year and featured a distinctive lacing system and wing-like top design. Swoopes <a href=https://kickstory.co/en/journals/her-airness-sheryl-swoopes-2/>wore them</a> to win gold at the 1996 Olympics and for a few games the following year with the Houston Comets to capture the league title in the WNBA’s inaugural season. In between those two championships, Swoopes had a baby. <a href=https://www.theatlantic.com/sexes/archive/2013/07/how-sheryl-swoopess-pregnancy-changed-professional-sports-forever/278168/>Six weeks after giving birth</a>, she was back on the court providing a blueprint on how to handle pregnancy and professional sports. Today, the Air Swoopes II are one of the most well-known versions of Swoopes’ shoes, especially since Nike<a href=https://www.sbnation.com/2018/8/17/17684330/nike-air-swoopes-ii-sheryl-swoopes-retro-female-basketball-shoes-wnba> re-released them</a> in 2018, over 20 years since their original drop."},{"shoeID":"3","shoeName":"Lobo","shoePlayer":"Rebecca Lobo","shoeBrand":"Reebok","shoeDate":"1997","shoeDesc":"Reebok approached Lobo about a signature shoe in 1995 while she was still playing at the University of Connecticut (the Huskies were also sponsored by Reebok). By the time the shoes were officially released in 1997, Lobo had won gold with Team USA at the 1996 Olympics and began her pro career with the New York Liberty for the WNBA’s first season. <a href=https://andscape.com/features/the-complete-history-of-signature-sneakers-in-the-wnba/>Lobo recalls walking</a> by a Lady Foot Locker in the city and seeing her shoes: “I remember seeing a banner of me and they also had these 5×7 postcards, with me holding up the shoe… When I was a kid, I loved to walk by sneaker stores or walk in. I didn’t have a lot of money to get them but was just checking stuff out. So, I just remember seeing the display and being like, ‘That’s really, really cool.’”"},{"shoeID":"4","shoeName":"Air Swoopes Zoom (III)","shoePlayer":"Sheryl Swoopes","shoeBrand":"Nike","shoeDate":"1997","shoeDesc":"Swoopes’ third model was dropped in 1997, the same year her Houston Comets won the first of <a href=https://www.wnba.com/all-time-wnba-champions/>four consecutive WNBA championships</a>. Swoopes was one third of the <a href=https://www.texasmonthly.com/arts-entertainment/wnba-houston-comets-legacy/>team’s “Big Three”</a> along with fellow future hall of famers Cynthia Cooper and Tina Thompson. The Air Swoopes Zoom featured a <a href=https://kickstory.co/en/journals/her-airness-sheryl-swoopes-2/>claw-like design</a> up the side to help insure stability and protect Swoopes’ ankles."},{"shoeID":"5","shoeName":"Total Air 9","shoePlayer":"Lisa Leslie","shoeBrand":"Nike","shoeDate":"1998","shoeDesc":"Nike signed superstar Los Angeles Sparks’ center Lisa Leslie as their second signature athlete after Swoopes. Leslie had landed a prestigious modeling contract with Wilhelmina agency right before winning gold with Team USA at the 1996 Olympics. Once it was clear that the hype around women’s hoops wasn’t fading and that a women’s pro league backed by the NBA would become a reality, Leslie switched to the hardwood full time. But she didn’t leave her <a href=https://boardroom.tv/lisa-leslie-shoe-nike-air-total-9/ >fashion sensibilities</a> behind: “I patterned my shoe after Chanel, ’cause I couldn’t afford Chanel back in the day,” she said. “So I wanted my Nike shoe to have a little Chanel puff on it.” Leslie only had one signature sneaker model during her playing career (which included 2 WNBA titles and 3 league MVP awards), but Nike would later go on to honor her with a pair of <a href=https://www.nike.com/launch/t/womens-dunk-low-lisa-leslie>custom designed dunks</a>. The shoes were released in 2022, 20 years after Leslie threw down the WNBA’s first dunk."},{"shoeID":"6","shoeName":"Air Swoopes IV","shoePlayer":"Sheryl Swoopes","shoeBrand":"Nike","shoeDate":"1998","shoeDesc":"In 1998 Swoopes won her second consecutive WNBA championship with the Houston Comets and dropped her fourth consecutive shoe, the Air Swoopes IV. The Air Swoopes IV was billed as a shoe for the <a href=https://blog.eastbay.com/all/eastbay-memory-lane-womens-basketball-1998/>“athletic, aggressive player”</a> and featured wavy side construction to promote quick, explosive movement."},{"shoeID":"7","shoeName":"Air C14","shoePlayer":"Cynthia Cooper","shoeBrand":"Nike","shoeDate":"1999","shoeDesc":"Cynthia Cooper had come into the WNBA in 1997 as a 34-year-old rookie, and she <a href=https://www.theplayerstribune.com/posts/cynthia-cooper-dyke-wnba-basketball>carried a chip</a>: “Y’all are launching a league now?! As in: NOW now??? As in, when I’ll be 34?!? You couldn’t have launched this during my prime, over these last 10 years?? While I was giving them Michael numbers in Italy??” But Cooper continued to put up Michael numbers in the WNBA. By the 1999 season she had won two titles with the Houston Comets, two MVP awards, and earned her own signature shoe. Right before their official launch, Cooper lost her mom to breast cancer, and two weeks after the release her teammate Kim Perrot died from brain and lung cancer. Cooper says the Air C14’s <a href=https://andscape.com/features/the-complete-history-of-signature-sneakers-in-the-wnba/>hold a special place in her heart</a>: “That year I wore the C14s will always stand out in my mind,” she said. “I had ‘Mom’ and ‘10’ written on my shoe … after I had lost two people who were very special to me. So that shoe is memorable.”"},{"shoeID":"8","shoeName":"Nikki Delta","shoePlayer":"Nikki McCray","shoeBrand":"Fila","shoeDate":"1999","shoeDesc":"In 1999, Nikki McCray signed a $1 million contract with Fila and released the brand’s first signature shoe from a woman baller. <a href=https://andscape.com/features/the-complete-history-of-signature-sneakers-in-the-wnba/>Fila collaborated with McCray</a> to load the Nikki Delta with personal touches: flames to represent her quickness, her number 15 on the bottom so you saw it every time she took a step, her name in the insole, and colorways that matched both Team USA and her WNBA Washington Mystics. <a href=https://andscape.com/features/the-complete-history-of-signature-sneakers-in-the-wnba/>McCray said one of the best things</a> about having her own shoe was seeing a “line of thousands” wrapped around the block for the launch event: “It was little girls, it was families and it was little boys, and that’s what it’s about,” she said. “It’s about the impact that it gives little girls hope.”"},{"shoeID":"9","shoeName":"Air Tuned Swoopes (V)","shoePlayer":"Sheryl Swoopes","shoeBrand":"Nike","shoeDate":"1999","shoeDesc":"Swoopes recorded the WNBA’s <a href=https://justwomenssports.com/wnba-basketball-triple-double-how-many-history/#:~:text=11%20total%20players.-,Sheryl%20Swoopes,10%20rebounds%20and%2010%20assists.>first ever triple-double</a> (14 points, 15 rebounds, 10 assists) while wearing her fifth signature model, the Air Tuned Swoopes (V). And, her play in 1999 would propel her Houston Comets to win their third consecutive WNBA title. The shoes feature one of Swoopes’ <a href=https://kickstory.co/en/journals/her-airness-sheryl-swoopes-2/>most striking silhouettes</a> with flexible plastic webbing around the body."},{"shoeID":"10","shoeName":"Zoom S5","shoePlayer":"Dawn Staley","shoeBrand":"Nike","shoeDate":"1999","shoeDesc":"Today Dawn Staley is known for her <a href=https://www.espn.com/womens-college-basketball/story/_/id/33263850/the-style-substance-south-carolina-dawn-staley>swagger as the University of South Carolina’s championship coach</a>, but she’s been bringing the heat since at least 1999, her first year playing in the WNBA. Like Staley’s play, the Zoom S5 was a <a href=https://www.nicekicks.com/opinion-dawn-staleys-nike-zoom-s5-greatest-womens-signature-shoe/>flashy model with a strap system</a> that sported a graffiti-inspired combination of her last initial (S) and her Charlotte Sting jersey number (5). Staley is still a big fan of the Zoom S5: </a> “Nike needs to bring that thing back,” <a href=<a href=https://andscape.com/features/the-complete-history-of-signature-sneakers-in-the-wnba/>she said.</a> “My shoe was built on Philly. It was built on toughness. It was built on being able to handle whatever was thrown at me. It was built on being an odds beater. When I had my signature shoe on, I was in my mode of, ‘This is it. This is, like, basketball utopia for me.’”"},{"shoeID":"11","shoeName":"Air Swoopes VI","shoePlayer":"Sheryl Swoopes","shoeBrand":"Nike","shoeDate":"2000","shoeDesc":"In 2000, Swoopes sported her sixth model as she returned to returned to the Olympics along with Team USA and captured gold in Sydney. She would also win her fourth consecutive WNBA title with the Houston Comets and take home <a href=https://www.wnba.com/history_mvp/>WNBA MVP awards</a>. The Air Swoopes VI are a stark contrast to Swoopes’ previous model: the outside is  a single shape made out of a shiny, iridescent leather. The minimal design checked all the boxes for Swoopes when thinking about what makes a good signature shoe: “I wanted it to be comfortable and not heavy. It had to have really good ankle support … and I wanted it to look good.”"},{"shoeID":"12","shoeName":"Shox BB4 Mique","shoePlayer":"Chamique Holdsclaw","shoeBrand":"Nike","shoeDate":"2001","shoeDesc":"By 2001, Holdsclaw was a household name. She had <a href=https://www.utk.edu/history/chamique-holdsclaw-womens-basketball-sixth-championship>three-peated the NCAA championship</a> while at the University of Tennessee (1996, 1997, 1998), she was <a href=https://www.wnba.com/all-time-wnba-draft-picks/>selected first overall</a> by the Washington Mystic in the 1999 WNBA draft, and she was named the WNBA’s <a href=https://www.wnba.com/history_rookie-of-the-year/>Rookie of the Year</a> in her first season. The Shox BB4 Miques featured Nike’s new Shox technology: a cylindrical heel cushioning system built to absorb impact. Holdsclaw collaborated with designers, who ultimately <a href=https://andscape.com/features/the-complete-history-of-signature-sneakers-in-the-wnba/>drew inspiration</a> from rockets and the moon’s texture, as seen in the “craters” on the outside of the shoe."},{"shoeID":"13","shoeName":"Air Swoopes Premier (VII)","shoePlayer":"Sheryl Swoopes","shoeBrand":"Nike","shoeDate":"2001","shoeDesc":"The Air Swoopes Premier (VII) were Swoopes’ seventh and final model. Before the 2001 WNBA season began, she <a href=https://www.wnba.com/news/sheryl-swoopes-career-timeline-3/>tore the ACL</a> in her left knee and was forced to miss the entire season. The dynamic player bounced back, reclaiming the <a href=https://www.wnba.com/history_mvp/>MVP title</a> in 2002, but her run of shoes had ended. The 2000s ushered in a <a href=https://www.washingtonpost.com/archive/sports/2000/08/23/the-wnba-is-growing-but-not-without-pains/d1a13524-82a8-401f-8788-2b3e2fa0b965/>era of growing pains</a> for the WNBA, as some of the sparkle from the 1996 US-based Olympics had worn off for advertisers, companies, and business ventures (it never wore off for the dedicated fans or players), and that trickled down to the dwindling number of WNBA players with signature sneakers through the decade. Looking back on her shoes <a href=https://andscape.com/features/the-complete-history-of-signature-sneakers-in-the-wnba/>Swoopes said</a>: “When I think about it, I understand how big of a moment that was. Not just for me, but for so many young girls and women coming after me.”"},{"shoeID":"14","shoeName":"Shox Mique","shoePlayer":"Chamique Holdsclaw","shoeBrand":"Nike","shoeDate":"2002","shoeDesc":"In 2002 Holdsclaw claimed the <a href=https://www.basketball-reference.com/wnba/leaders/pts_per_g_yearly.html>WNBA’s scoring title</a> and released the follow up to her first Shox model, the Shox Mique. She said it’s the first model <a href=https://andscape.com/features/the-complete-history-of-signature-sneakers-in-the-wnba/>she remembers playing in</a>: “I remember that moment. I remember motions. I remember hitting a step-back fadeaway, and when I made the shot, my leg was up. When I was running back, I looked down, and I was like, ‘Oh, man, I’m wearing my own shoe!’ ” The following year, Holdsclaw’s <a href=https://solesavy.com/a-history-of-wnba-athletes-signature-sneakers/>deal with Nike, which she reportedly signed in 1999 for $1 million making her the highest paid player in the WNBA, would elapse</a>. The Shox Mique would be her last shoe and would end eight consecutive years with a signature shoe from a WNBA player."},{"shoeID":"15","shoeName":"Air Taurasi","shoePlayer":"Diana Taurasi","shoeBrand":"Nike","shoeDate":"2005","shoeDesc":"After a three-year hiatus without any WNBA signature shoes, Taurasi released the Air Taurasi. The flashy shooting guard was signed by Nike fresh out of the University of Connecticut where she won the NCAA title all four years. Taurasi was named the 2004 WNBA <a href=https://www.wnba.com/history_rookie-of-the-year/>Rookie of the Year</a> in her first season with the Phoenix Mercury — her first shoes dropped the following year. The Air Taurasi’s has a <a href=https://andscape.com/features/the-complete-history-of-signature-sneakers-in-the-wnba/>“DT3” logo</a> (Taurasi’s first and last initials plus her jersey number) on the side and the most common colorway was a red, white, and blue UConn scheme."},{"shoeID":"16","shoeName":"Shox DT","shoePlayer":"Diana Taurasi","shoeBrand":"Nike","shoeDate":"2006","shoeDesc":"While wearing the Shox DT in 2006, Taurasi had a historic year: among other scoring records, she claimed the WNBA record for the <a href=https://www.wnba.com/news/diana-taurasi-25-numbers-to-know-about-the-goat/>highest single-season scoring average</a> at 25.3 points per game and she scored a <a href=https://www.wnba.com/news/diana-taurasi-25-numbers-to-know-about-the-goat/>career high (and then WNBA record) 47 points</a> in a triple-overtime win against the Houston Comets. The Shox DT were Taurasi’s last signature shoe, but the <a href=https://www.nba.com/news/diana-taurasi-voted-by-fans-as-wnbas-greatest-player-of-all-time>WNBA fan voted Greatest of All Time (GOAT)</a> still sports custom Nikes. She’s been wearing LeBrons since 2007, and last year the company <a href=https://www.nike.com/launch/t/diana-tauraso-lebron-18-goat-vision>dropped a special  'GOAT Vision’</a> version honoring Taurasi in her 17th season."},{"shoeID":"17","shoeName":"Ace Commander","shoePlayer":"Candace Parker","shoeBrand":"Adidas","shoeDate":"2010","shoeDesc":"Parker’s first signature shoe, the Ace Commander, also marked Adidas’ first foray into the WNBA market. Parker gained notoriety at the University of Tennessee (an Adidas-sponsored program), and carried the three strips with her when she decided to forgo her senior season to turn pro. Parker had a breakout first season in 2008 with the Los Angeles Sparks: she became the first player to win both the <a href=https://www.wnba.com/history_mvp/>MVP</a> and <a href=https://www.wnba.com/history_rookie-of-the-year/>Rookie of the Year</a> awards in the same year. She dropped her breakout shoe 2 years later. Adidas worked with Parker to develop her <a href=https://andscape.com/features/the-complete-history-of-signature-sneakers-in-the-wnba/>“Ace” nickname and logo</a>, which incorporates her number 3 and a heart. Parker said: “It’s not a king, it’s not a queen, and there’s no gender with an Ace. It’s about the person and the human being.”"},{"shoeID":"18","shoeName":"Ace Versatility","shoePlayer":"Candace Parker","shoeBrand":"Adidas","shoeDate":"2011","shoeDesc":"In 2011, Parker followed up the Ace Commander with the Ace Versatility. Borrowing from her first model’s intricate starburst stitching, the Ace Versatility featured <a href=https://andscape.com/features/the-complete-history-of-signature-sneakers-in-the-wnba/>“Ace” stitched</a> on the inner side collar. Both shoes were designed in gold and purple for Parker’s team at the time, the Los Angeles Sparks, and feature an Adidas stripe support strap. Parker (and the WNBA) wouldn’t have another signature shoe for a decade. But in that time, she kept busy: she won a <a href=https://www.wnba.com/all-time-wnba-champions/>WNBA title with the Sparks</a> in 2016 and was named finals MVP that same year. She <a href=https://www.tennessean.com/videos/sports/2016/10/21/92501822/>dedicated the championship to Pat Summitt</a>, her coach and mentor at the University of Tennessee, who died earlier that year from Alzheimer's disease."},{"shoeID":"19","shoeName":"Exhibit A","shoePlayer":"Candace Parker","shoeBrand":"Adidas","shoeDate":"2021","shoeDesc":"Ten years since her last release, Parker and Adidas unveiled another signature shoe in 2021. “It’s really special, and I do believe in women’s sports and I do believe in women’s power in selling,” <a href=https://andscape.com/features/the-complete-history-of-signature-sneakers-in-the-wnba/>she said</a>. “To see this come to light and see all that’s come since in the 10 years in between, it means a lot to me.” The Exhibit A serves as a <a href=https://andscape.com/features/the-complete-history-of-signature-sneakers-in-the-wnba/>personal journey through Parker’s career</a>: “I feel like every part of my life has been represented in the shoes, from my Tennessee days to Naperville, out to LA and then back home again,” she said. Under one tongue, you’ll find her daughter’s name Lailaa, and under the other “For Pat,” honoring her coach at the University of Tennessee, Pat Summitt. While wearing the Exhibit As in 2021, Parker again won the WNBA title, this time with her hometown team the Chicago Sky."},{"shoeID":"20","shoeName":"DELDON 1","shoePlayer":"Elena Della Donne","shoeBrand":"Nike","shoeDate":"2022","shoeDesc":"2022 is a breakout year for WNBA signature sneakers: Elena Della Donne’s DELDON 1 are the first signature shoes released by Nike since 2006. The shoes mark a rebirth of Della Donne too, who won the WNBA title with the Washington Mystics and was named <a href=https://www.wnba.com/history_mvp/>league MVP</a> in 2019 and then missed the following two seasons (including one in the <a href=https://www.youtube.com/watch?v=SaEboaRO7CM>“Wubble”</a>) due to back injuries. The rainbow gradient colorway is part of Nike’s <a href=https://www.nike.com/betrue>BE TRUE collection</a>, which aims to help “LGBTQIA2S+ athletes redefine what it means to be proudly in motion.” The DELDON 1, which is scheduled to drop in October, also features <a href=https://www.soleretriever.com/news/articles/nike-air-deldon-1-betrue-release-date-2022>Della Donne’s initials “EDD”</a> embroidered on the side."},{"shoeID":"21","shoeName":"Exhibit B","shoePlayer":"Candace Parker","shoeBrand":"Adidas","shoeDate":"2022","shoeDesc":"Parker’s Exhibit B made an early appearance when her daughter Lailaa helped design a <a href=https://www.nicekicks.com/candace-parker-adidas-exhibit-b-mothers-day-pe/>custom pair of kicks for Mother’s Day</a>, a couple of months before the official release. There are several colorways for the Exhibit Bs, all with their own <a href=https://hypebeast.com/2022/7/candace-parker-adidas-exhibit-b-gz2378-release-date>special meaning</a>: the emerald green “For Lailaa Nicole” honors her daughter, “Game Royalty” in purple and gold nods to African queens, and ash blue “Windy City” celebrates Parker’s 2021 WNBA title with the Chicago Sky. In addition to the re-mergence of Parker’s signature sneakers, she’s also released a <a href=https://www.adidas.com/us/candace_parker>signature collection</a> of other athletic apparel. Parker’s ready to see <a href=https://www.complex.com/sneakers/candace-parker-adidas-ace-collection-interview>more WNBA stars join her</a>: “I love ACE, but I want there to be another. I want this to open up two or three or four doors. So I hope that that’s what it does.”"},{"shoeID":"22","shoeName":"Stewie 1","shoePlayer":"Breanna Stewart","shoeBrand":"Puma","shoeDate":"2022","shoeDesc":"With the trifecta (Stewart’s Stewie 1s, Della Donne’s DELDON 1s, and Parker’s Exhibit Bs), it’s the first time since 1999 that there will be three or more WNBA players with signature shoes. Stewart’s shoes also mark Puma’s first ever WNBA sneaker deal. The Seattle Storm phenom, and two-time league champion and <a href=https://www.wnba.com/history_mvp/>MVP</a> sported the electric green and black colorways during the 2022 season and they officially dropped in September. Stewart says the <a href=https://www.si.com/wnba/2022/07/08/breanna-stewart-signature-shoe-stewie-1-puma>shoes, nicknamed “Quiet Fire”, are personal</a>: “It’s who I am as a person and as a player. The ability to make noise without saying much.” The Stewie 1s feature a northstar on the sole, a nod to her high school mascot, a scar mark on the heel referencing her two Achilles surgeries, and a combined logo of her initials “BS” on the tongue."},{"shoeID":"23","shoeName":"Sabrina 1","shoePlayer":"Sabrina Ionescu","shoeBrand":"Nike","shoeDate":"2023","shoeDesc":"In 2023 New York Liberty guard Sabrina Ionescu became the <a href=https://andscape.com/features/sabrina-ionescu-joins-wnba-rare-air-with-her-first-nike-signature-sneaker/>8th woman</a> to have a signature shoe, and the ​​<a href=https://about.nike.com/en/newsroom/releases/sabrina-ionescu-sabrina-1-official-photos>first women’s basketball player</a> to deliver a unisex signature collection for Nike. The Sabrina 1’s <a href=https://about.nike.com/en/newsroom/releases/sabrina-ionescu-sabrina-1-official-photos>pay homage to her heritage</a> with intricate embroidery patterns that reference Romanian art and architecture. There’s also more subtle details like the hidden “Anyone, Anywhere” quote, meant to inspire dreamers no matter where they are."},{"shoeID":"24","shoeName":"Exhibit Select","shoePlayer":"Candace Parker","shoeBrand":"Adidas","shoeDate":"2023","shoeDesc":"During the 2023 All Star in Las Vegas weekend Parker, the <a href=https://aces.wnba.com/news/aces-sign-candace-parker/>newest addition</a> to the stacked Aces’ roster, dropped her third shoe and collection with Adidas. The Exhibit Select will have <a href=https://www.si.com/fannation/sneakers/news/candace-parkers-third-adidas-collection-is-here>3 initial colorways</a>: “Champagne,” inspired by championship celebrations;  “Game Royalty,” inspired by African warrior queen Kandake, the origin of the name Candace; and “Queen of Cards,” which features card imagery and the number 3 to represent Candace’s NCAA, WNBA, and Olympic titles trifecta."},{"shoeID":"25","shoeName":"Stewie 2","shoePlayer":"Breanna Stewart","shoeBrand":"Puma","shoeDate":"2023","shoeDesc":"Stewart’s second signature shoe dropped just before her 2023 debut with the New York Liberty <a href=https://www.si.com/wnba/2023/04/24/new-york-liberty-superteam-stewart-jones-vandersloot-daily-cover>“super team.”</a> The gem red monotone silhouette was <a href=https://www.nicekicks.com/puma-stewie-2-ruby/>named after her daughter</a>: “I knew I wanted to name it after my daughter, Ruby. Not only to symbolize the incredible bond I share with my daughter, but also to pay homage to the unwavering strength and resilience of mothers everywhere.” The Stewie 2 Ruby features flame-like markings around the sole and “WARNING” stripes on the back, presumably to warn opponents that dropping <a href=https://theathletic.com/4539300/2023/05/21/breanna-stewart-liberty-points-record/>45 points</a> and claiming the Liberty’s single game scoring record is just the beginning for Stewart in New York."},{"shoeID":"26","shoeName":"Sabrina 2","shoePlayer":"Sabrina Ionescu","shoeBrand":"Nike","shoeDate":"2024","shoeDesc":"Fans got a first look at the “Cave Purple” colorway of the Sabrina 2s when leaked images began to surface in mid-May right before tip off of the 2024 WNBA season. Like the Sabrina 1, the Sabrina 2 will be available in mens, womens, and kids sizes, cementing it as a truly unisex basketball shoe. “I'm excited to be able to see how the 1 kind of took the world by storm on the women's side but particularly on the men's side to see how that's been able to translate,” <a href=https://twitter.com/GreydyDiaz/status/1784733183553995136>Ionescu said</a>. “That was my goal from the beginning to just create equality with a sneaker and to be able to see that come to life.” The shoe <a href=https://sneakernews.com/2024/05/13/nike-sabrina-2-release-date/>“boasts the same design DNA”</a> as the Sabina 1, but with a slightly sleeker and lower profile."},{"shoeID":"27","shoeName":"Stewie 3","shoePlayer":"Breanna Stewart","shoeBrand":"Puma","shoeDate":"2024","shoeDesc":"Stewart’s third shoe, <a href=https://about.puma.com/en/newsroom/product-and-brand-news/2024/11-04-2024-puma-hoops-and-breanna-stewart-launch-stewie-3>featuring fiery hues and floral details</a> — released right before her third trip to the Olympics — incorporates designs inspired by her first two appearances: a golden trumpet tree for Rio de Janeiro (2016) and a cherry blossom for Tokyo (2020). Other floral references include a red carnation as tribute to Stewart's spouse <a href=https://www.instagram.com/martaxargay/?hl=en>Marta</a> (a pro athlete in her own right) and her home country of Spain, a blooming seed pattern for the couple’s daughter <a href=https://www.youtube.com/watch?v=c7oYhWpwUvg>Ruby</a>, and a high-abrasion outsole designed to look like roots. All of the details combined tell the story of Stewart’s desire to grow and cultivate the game."},{"shoeID":"28","shoeName":"Signature Syd","shoePlayer":"Sydney Colson","shoeBrand":"Creative Control","shoeDate":"2024","shoeDesc":"After being named an official brand partner of <a href=https://www.creativecontrol.com/>Creative Control</a>, Colson debuted her signature shoe during the first round of the 2024 playoffs. In a <a href=https://www.instagram.com/sydjcolson/reel/DAWQPCGSdLC/?hl=en>release video</a> poking run at her playing time, Colson said: “I partnered with a company called Creative Control, and they felt like my authenticity, and sense of humor, and connection to my community transcend any stat sheet.” After all, the Las Vegas Aces reserve guard is <a href=https://www.instagram.com/sydjcolson/reel/CxoS23bSI_-/>one of the faces of the league</a>."}],"info":[{"type":"text","value":"All shoes were drawn as vectors in Adobe Illustrator from reference photos found online. Some photos were of better quality than others, resulting in more detail on the shoes. The shapes were exported as SVGs and morphed using <a href=https://github.com/veltman/flubber>Flubber</a>, a javascript library from <a href=https://noahveltman.com/>Noah Veltman</a>."},{"type":"text","value":"Only shoes of players with signature silhouettes were included. This excludes player edition shoes like <a href=https://www.sneakerfreaker.com/releases/wnba-star-maya-moore-gets-her-own-jordan-10s>Maya Moore’s Air Jordan 10s</a>, <a href=https://www.complex.com/sneakers/a/cmplxvictor-deng/diana-taurasi-nike-lebron-18-pe-cq9283-401-release-date>Diana Taurasi’s LeBron 18 EP 'G.O.A.T.'</a>, <a href=https://www.goat.com/sneakers/kyrie-5-keep-sue-fresh-cw2771-100>Sue Bird’s Kyrie 5 'Keep Sue Fresh'</a>, or <a href=https://www.nike.com/t/gt-cut-2-x-arike-ogunbowale-basketball-shoes-P4nsq2/FQ8704-800?cp=95544465561_osoc_>Arike Ogunbowale’s G.T. Cut 2</a>."},{"type":"text","value":"If you liked this project, check out our original <a href=https://pudding.cool/2018/09/jordans/>morphing Air Jordans piece</a>. You can buy this <a href=https://the-pudding.printify.me/product/8358/wnba-kicks-poster>WNBA Kicks project</a> and the <a href=https://the-pudding.printify.me/product/8398/air-jordans-poster>Air Jordans</a> version in poster form."},{"type":"text","value":"This project is not affiliated with any shoe brands featured including <a href=https://www.adidas.com/>Adidas</a>, <a href=https://www.fila.com/>Fila</a>, <a href=https://www.nike.com/>Nike</a>, <a href=https://us.puma.com/us/en>Puma</a>, or <a href=https://www.reebok.com/us>Reebok</a>."}]}